[
  {
    "id": 1,
    "title": "A Man in LOVE",
    "date": "",
    "excerpt": "Few words devoted to the man ...",
    "content": " <p>A man in love is a Heart of Gold</p><p>A man in love is a Dreamer with a purpose.</p><p>A man in love is a strength to his girl.</p><p>A man in love is a childlike spirit.</p><p>I can hear his heartbeat whisper to my name.</p><p>I can read his thoughts flowing endlessly towards me.</p> <p>I can feel a subtle, yet powerful force encouraging me to do things.</p><p>I can sense the immense comforting calm even in a crooked mental picture. Phantasm.</p> <p>He describes me as the most precious work of art.</p><p>He turns my ordinary moments into extraordinary memories.</p><p>He makes me laugh and smile even when there's a thunderstorm in my head.</p><p>Also, he never misses a chance to pull me in his direction via an invisible thread.</p>"
  },
  {
    "id": 2,
    "title": "Spellbound in Pokhara",
    "date": "9th June 2024",
    "excerpt": "I am here at Pokhara doing nothing as if I have no work. But I donot have anything to hung into except his words...",
    "content": "<p>I am here at Pokhara doing nothing as if I have no work. But I donot have anything to hung into except his words. I have been so captivated by his words. As was previously mentioned not to expect, keep distance and all so yes I am not doing that. But it is kind of like I will do those things that he likes. But deep inside I know I won't be able to withstand the person who is not at all caring. I still remember those words of his, all those articles that he asked me to read, and have mentioned there that he used to wait for someone to call rather than making his step first. Umm, I am a person who loves to be cared. The small gesture makes me happy Holding the door open at a coffee shop, holding onto the scooter until I get off, or pouring the rajma onto my plate and waiting until I've finished my food. Ah, I remember the second meeting. Once, ah the second meet. At Himalayan Java of krishna mandir, I wasnot even done with coffee ani la jam ray haha. He is ekdam weird. Tara ni wanna hold him. I mean hold him physically as like hug him right away not as if hold on to him over ever . He has just come out, I guess, out of his relationship. Tara his words push me away from thinking more than this, though I haven’t.</p>"
  },
  {
    "id": 3,
    "title": "Before its too late",
    "date": "",
    "excerpt": "When love comes it comes every aspect , from head to toe , you will even love the unpleasant fragnance of theirs ...",
    "content": "<p>You are prolly not the one who doesnt know how to treat a girl . If she is putting so much effort to be with you . What can be more precious for a man to be with a girl who is willing to be yours even without you asking her to be yours? Are you really afraid of those serious commitments or its just in between things where you want her for infinite intimacy and attention. Its not that you arent aware about how much she is into you and how much more will she do when she will know even you are in the same phase. I m ready to wait for you until you to be ready to be where you want to be . But I should atleast be assured that you are definitely going come one day. Learn to embrace people before its too late .</p>"
  },
  {
    "id": 4,
    "title": "A agape unnoted",
    "date": "",
    "excerpt": "the feeling of being with them and still  being abandon on presence of everything ...",
    "content": "<p><p>A time when my heart beat only for you.<br>Where I found the true myself again, falling for a guy.</p><p>The feeling was different, unsure about every action.<br>  I was obsessed with the guy.</p><p>But you, dear ...., you were blind to see the depth<br>of all I felt within — the endless nights I dreamed of us together.</p ><p>The imagination was different — full of fantasizing.<br>We — I being one — had made a guy a tenant in my thoughts.</p> <p>I gave myself, my every breathe<br> To love you — from a far and near.</p> <p>But you seemed to be lost in your own world,<br> where you didn’t seem concerned,<br>and never noticed how I cared.</p><p>Now time has passed.<br>My heart, once yours, begins to heal.</p> <p>The love I held is fading fast,<br> as I learn again how to feel.</p></p>"
  },
  {
    "id": 5,
    "title": "Divergence",
    "date": "",
    "excerpt": "on the way of being familiar with each other , this is what I found ...",
    "content": "<p>A clash of opinion.</p><p>A pool of disagreement</p><p>Alienation, where a shadow cast by lights.</p> <p> Asking to understand me</p><p>A Trying to understand him</p><p>A huge drift of thoughts</p><p>A massive strife</p><p>Not knowing where it is going</p><p>But definitely not on the way I want.</p><p>People who I assumed knew me weren't even sufficiently near to get me </p><p> May be the span is now vanishing.</p><p>Potentially we might be retreating. </p<p>At the end, I want my happiness .</p><p>  Ultimately, I want peace.</p ><p> — Seemron</p>"

  },

  {
    "id": 6,
    "title": "A love story",
    "date": "",
    "excerpt": "A love story is not just about two people falling in love. It is about the journey they take together, the challenges they face...",
    "content": "<p>A love story is not just about two people falling in love. It is about the journey they take together, the challenges they face, and the moments that define their relationship. It is about the laughter, the tears, and the memories they create along the way. A love story is a testament to the power of love and its ability to overcome obstacles and bring people together.</p>"
  },

  {
  "id":7,
  "title": "A Time Wasted",
  "date": "7th July 2024",
  "excerpt": "Its better to fold the book and place it in some unseen corner of the book shelves .",
  "content": "<p><p>I have to learn to resist this obsession towards him.<br>Resisting to resist myself from dialing his number on my phone.<br>Persisting myself to call and say, “Hey, I am missing you...”</p><p>As if the thoughts will never come.<br>It’s totally a time being wasted.</p> <p>True.</p><p>Nobody is that benighted, empty-headed soul who won’t get what you feel.<br>No one is that unlearned or unlettered to lack the sensitivity of emotions or affection.<br>It is just the state of acting unperceptive.</p></p><p>-Seemron</p>"
  },


  {
    "id": 8,
    "title":"Hope",
    "date": "21 Jan 2025",
    "excerpt": "the persistence will of  living the phase again ...",
    "content": "<p>Somewhere I hope to see you again.<br>I imagine us to be what we were, again.<br>I wish my phone to ring where the incoming call would be saved with your name,again.<br>I dream you to miss a quiet rhythm of us, again.<br>I anticipate every passing moment feels heavier for him without me near, again.</p><p>I expect my silence to hum in the corner of his heart, now.<br>I wish him to chase the shadow in the space where I used to be, now.<br>I want my absence to wrap around him like a melody he can't forget, now.</p><p>May he feel the innocence in me.<br>May he realize the depth of how much I cared.<br>May my memory linger in a corner of his heart.<br>May something pull him to look behind—to notice what he’s missing or left behind.</p> <p>May the breeze carry the scent of my jacket again, which might be somewhere there on his floor.<br>May the dawn break with the whisper of my name.<br>Let him ache for the comfort that we once shared.<br>May he feel my absence like an unfinished line of my writing.<br>May he yearn the sound of me, yet find it never to be heard again.<p>-Seemron</p>"
  },

  {
    "id": 9,
    "title": "For My About to Be Other Half",
    "date": "21 July 2025",
    "excerpt": "आफैँ आउन पर्ने कुरा भन्या थियौ त, तिमीलाई चाहिँ आइरहेको छैन अइलि। ...",
    "content": "<p>I don’t look for the 4 wheeler to go on a drive with you.</p> <p>My heart dances with joy with you stand in front of my house on that scooter to pick me.</p><p>You really don’t need to take me the dazzling and costly restaurants.</p><p>Just get me a plate of pani puri or a roasted corn from the road side vendor.</p><p>“Baby, म तिमीलाई के किन्दिम त? चकलेट किन्दिम”</p><p>Hearing this makes me feel pampered .. though I usually say “NO”.</p><p>Yes, अजकल  म धेरै फोन गर्दिनँ but I wait on the other side for the call, patiently and calm.</p><p>I don’t even say anything, but he senses everything these days.</p><p>He is knowing me like I wanted to be known by my beloved.</p> <p>I would love to hold those hands and walk side by side.</p><p>Loves should bring everything.</p> <p>For me its you ..</p><p>I really had loved someone now .. and that is you.</p><p>It feels good to have my words remembered.</p> <p>I can sense my happiness has started mattering a lot.</p> <p>For me , the love rose again for you and if it ends... it ends with you.</p><p>I cant see myself in other's arms except   yours </p><p> This crazy heart of mine has woven every timeline of your lives.</p>  <p>My wishes are now his commands.</p> <p>I want him to do good and a lot of good.</p><p>Keeping you secret and close to my heart.</p><p>Just want to say I love you and keep loving me.<p>-Hons</p></p>"
  }

  ,
  {
    "id": 10,
    "title": "Done",
    "date": "14th April2024",
    "excerpt": "Once you get tired , then nothing works ....",
    "content": "<p>I am done putting all the efforts to get the attention I always wanted from you.</p><p>I held on to you. You are slowly letting me fade.</p><p>Your ignorance—I'm beginning to get used to it.</p><p>The expectation I had from you is dying.</p> <p>I am becoming the version of myself I usually reserve for others.</p><p>You could not find me as I got lost in you.</p><p>The change I had for you came on its own,</p><p>but the change you see in me now—</p><p>is because of you.</p><p>You are losing me. I’m sure of it.</p><p>-Seemron</p>"
  },
  {
    "id": 11,
    "title": "Closure",
    "date": "",
    "excerpt": "...",
    "content": " <p>There is never a thing like closure.</p><p>You could always have those traces. The echoes are fading in quiet spaces.</p><p>The ties that once bound are still there.</p><p>Closure, it’s approaching like gentle rain—drenching me and you slowly.</p><p>I am putting down the memories I have been carrying of us.</p><p>I no longer wait for those distant calls or texts.</p><p>Realizing day by day—some people can’t transmute them.</p><p>But they need to perceive: not everyone will hold on, no matter how.</p><p>Misconsideration will make anyone leave.</p><p>With every day that is passing by, you might be realizing that I am fading away.</p><p>Here, I let the silence rise.</p><p>Fire to burn and turn to ashes—lost to night and never to be seen.<p>-Seemron</p>"
  },

  {
    "id": 12,
    "title": "Faces",
    "date": "",
    "excerpt": "Long black hair , light brown eyes, pretty lips , cleft chin , pointed nose ... dont go on the facial characteristics ...",
    "content": "<p>Beneath the few words that praised each and every action of mine…</p> <p>Were the lies where truths were toned.</p><p>The cracks in the thoughts were mended temporarily—</p> <p>Which one day had to be seen, visible.</p><p>The gentle hands and those careful eyes weren’t actually real.</p><p>The fractures are mining through the thoughts.</p><p>Those remain as fragile thoughts now.</p><p>A careful word, a quiet plea—</p><p>Can’t patch the broken honesty.</p> <p>Despite being there, he was never there.</p>.-Seemron</p>"
  },
  {
    "id": 13,
    "title": "Used, Not Chosen",
    "date": "17th October 2024",
    "excerpt": " I am not being able to name it. I found a truth that shattered me. A message that I never thought, was seen.What was that .. what ever it was it was terrific ",
    "content": "<p>I am not being able to name it</p><p>I found a truth that shattered me.</p><p> A message that I never thought, was seen.</p>" 

     
  },

  {
    "id": 14,
    "title": "Falling Again",
    "date": " 15 Nov 2024",
    "excerpt": "A love story is not just about two people falling in love. It is about the journey they take together, the challenges they face...",
    "content": "<p>It is like falling again.</p><p>You secretly want the text to be '+4 messages'.</p> <p>You patiently wait for them to appear in your chat box on the top again when you are randomly scrolling through your feed.</p><p>Your reels algorithm started to change from gym and travel vlogs to romantic couples doing.</p><p>You await them to send the random things they are doing and screenshot them to catch glimpses later.</p> <p>They are miles away and countless hours, yet they are pulling me towards them.</p><p>They made me daydream about something I barely thought about.</p><p>I want it to last long.</p><p>I suppose if they sense it too.</p><p>In every message, I fall for love so strong.</p><p>I still dare to dream in a hope that love can bloom through a glowing screen.</p>-Seemron</p>"
  },

  {
    "id": 15,
    "title": "attachment ",
    "date": "6th july , 2025 ",
    "excerpt": "How fast and how soon . is it magic that is binding me to them ? ",
    "content": "<p> A kid with broken front teeth who was so shy and introvert during those first  two days to whom i always had to make my first move to talk  now talks non stop and is getting hard for me everyday to make him stop to talk during classes. “ kasto alxi lagyo , didi to aja dherai padam , how lovable  is that boy. Its a good thing if i dont have to go there but i usually miss him in those days when i dont have to attend him  . The way he comes smiling and makes excuses as saying “ mailay ta bisrihalxu “  are my forever green . I love to softly pull his cheeks and pat him to endorse him when he answers to my question.  The way he shouts saying “bye bye “ till i disappear from his sight makes me really overwhelmed . A month has completed and he is my favourite kid .  My neighbor’s kid  whom i never interacted with before was my next student . I still remember he saying on those every first day “ tapai engineer vanne thaxa , tara naam thaxaina “ makes me laugh still . He is shy , quite , obedient to some extend and honest . He is unfiltered. He  says what he kmows. He seems to be unware about the worldly things. He is adorable at the end. The next destination is now of girls . They are talkative . They are loud.  On of the girl there is studious ... to be continued </p>"
  },

  {
    "id": 16,
    "title": "I did right ...  ",
    "date": "3rd march 2025",
    "excerpt": "I didnt lie, I didnt fake , I just stopped feeling  and I said it when I did stop to feel...",
    "content": "<p>I used to be in love with complete certainty that it would never come to an end. I truly thought he was the one I'd marry — and for a while, it seemed like all the cards were falling into place to make it so. But things changed. Somewhere along the line, I discovered that it was not going to work, even with me still wanting their presence for some of the most difficult times — emotionally — especially when I was emotionally alone and needed them to have over as a support. And this is not entirely new to me. Earlier, there had been someone who cared about me so much — more than I could ever hope for. They would have done anything I wanted, questioningly, even if it was unnecessary or expensive. In hindsight, maybe I was drawn more to the things they offered than to whom they were. I loved, not maybe as much as they deserved. I never intended on hurting them — I lingered for as long as I was happy, for as long as the feelings seemed real. But happiness was fleeting, and the emotions soon wore off. But they were deeply fond of me. I wish with all my heart they move beyond this, that they fall deeply, truly, and reciprocally in love. I wish they find better — someone who chooses them each day. I find myself second-guessing at times, wondering if I was wrong to leave, if I somehow gave them hope that I could not uphold. But I was honest when we were there. I did not cheat, I did not lie — I just stopped feeling. And that, I could not help. I have a quiet guilt, not for how it ended, but for the weight of expectations that hung so far after I did. I simply wish to be me, without concession of what I am feeling. I didn't wish to fake it forever simply in case I was the one to leave. It pains me, yes — not because I betrayed them, but because I did love them, and yet still chose to leave. I merely wish that they realize sometimes love falls out without blame. And even in that ending, I wished them all the best. \n -Seemron</p>"
  },

  {
    "id": 17,
    "title": "Am I doing WRONG ?",
    "date": "5 TH MARCH 2025",
    "excerpt": "...",
    "content": "<p>Things didnt go as I thought it would go ..\n  What distracted me ? \n Did I change my mind ?  \n  If I did .. Why ? \n Why am i doing so ? \n Am I doing wrong to someone ? \n Why thinking this makes me sad and myheart fills with guilt , \n guilt that I am purposely taking .. \n Am i selfish ? OR  Heartless ? \n Are both  means same ? \n NO .. I dont want anything from anything .. \n These days I barely have anythng to ask queries .. queries that I have in me . \n I have different queries for differnt person I met in my life . may be they so do .. Different person may  also have different queries for me .  \n-Seemron  </p>"
  }, 

  {
    "id": 18,
    "title": "Forgetting ??? ",
    "date": "long back ",
    "excerpt": "I still remember his voice , his words , his statements , his gestures , his time to call , his talks ...",
    "content": "<p>I still remember his voice , his words , his statements , his gestures , his time to call , his talks , he and i and everything . The drink we order on meets and food we ate , the song we sang to the place we went , the time we spent to the time played … he and i and everything … <p>the memory we made to the words we share , the hug i gave to the hug i received , he and i and everything </p>.<p>From the attention I seeked to the attention I gave ,   From the  first touch that we were afraid of touching to hugging him from behind while riding his scooter  .. From that gentle cuddle in his arms to laying beside him and seeing him asleep , he and I gave Everything ... </p><p></p>From the first time I saw him to the last time I saw him , From the first time I talked to him to the last time I talked to him , From the first time I felt his presence to the last time I felt his presence , he and I and everything ... </p><p>From the first time he said he loved me to the last time he said he loved me , From the first time he said he missed me to the last time he said he missed me , From the first time he said he wanted me to the last time he said he wanted me , he and I and everything ... </p><p>From the first time we met to the last time we met , From the first time we kissed to the last time we kissed , From the first time we held hands to the last time we held hands , he and I and everything ... </p><p>From the first time we laughed together to the last time we laughed together , From the first time we cried together to the last time we cried together , From the first time we shared our dreams to the last time we shared our dreams , he and I and everything ... </p><p>From that moment when i thought i was falling in love with him to that moment when i thought i was falling out of love with him , From that moment when i thought i was losing him to that moment when i thought i was finding myself again , From that moment when i thought i was ready to let go of him to that moment when i thought i was ready to hold on to him forever , he and I and everything ... </p><p>From that moment when i thought i was forgetting him to that moment when i thought i was remembering him again , From that moment when i thought i was moving on from him to that moment when i thought i was moving back towards him , From that moment when i thought i was healing from him to that moment when i thought i was hurting for him again , he and I and everything ... </p><p>From that moment when i thought it was over between us to that moment when i thought it could start again between us , From that moment when i thought it was goodbye forever to that moment when i thought it was see you soon again , From that moment when i thought it was just a memory now to that moment when i thought it could be a reality again , he and I and everything ... </p><p>From all those moments we shared to all those moments we cherished, From all those moments we laughed to all those moments we cried, From all those moments we loved to all those moments we lost, he and I and everything ... </p><p>From all those moments we fought to all those moments we made up, From all those moments we argued to all those moments we understood, From all those moments we disagreed to all those moments we compromised, he and I and everything ... </p><p>From all those moments we dreamed to all those moments we achieved, From all those moments we hoped to all those moments we despaired, From all those moments we believed to all those moments we doubted, he and I and everything ... </p><p>From all those moments we trusted to all those moments we betrayed, From all those moments we respected to all those moments we disrespected, From all those moments we cared to all those moments we neglected, he and I and everything ... </p><p>From all those moments we supported to all those moments we abandoned, From all those moments we encouraged to all those moments we discouraged, From all those moments we inspired to all those moments we demotivated, he and I and everything ... </p><p>From all those moments we shared to all those moments we cherished, From all those moments we laughed to all those moments we cried, From all those moments we loved to all those moments we lost, he and I and everything ... </p><p>From all those moments we fought to all those moments we gave up, From all to nothing , He and I dont exist in each other world .</p><p>I wonder where is he ? He might be wondering the same .</p><p>He and I and everything to He and I and NOTHING"
  },


  {
    "id": 19,
    "title": "To my courtesy ",
    "date": "11TH August 2025",
    "excerpt": ".",
    "content": "<p>My love knows me well …\n Well in a sense … he knows what makes me happy and what pisses me off . Have i transformed him … or he implemented those changes on  his own . </p>"
  },
  {
    "id": 20,
    "title": "IN DISBELIEF",
    "date": "back in BE  days ",
    "excerpt": "The deep Guilt ",
    "content": "<p>The deep guilt  that I am carrying or feeling is unexplainabale. Have I really done wrong to people who were there in my life at some point of time .What am I feeling ? What am i doing infact? Where am I supposed do to ? Where am I walking.Have I choosen the wrong person again? I am already used to but. Am I chasing too much? What should be important to someone when they love someone? Why do I wonder while thinking , while riding? A thought of going back arose again. I feel like leaving where I am.Should I walk away before its  too late? Why am I wasting someone's time and my time too.I am begging for bare minimum too. Is it suppose to be my heartbreak again?\n What should I expect?\n . How much OKAY is really okay? \n Is there something called detactment? \n If so , grant me that capability once again.\n What am I settling for? \n I never got what I imagined, what I wanted. I guess I left those person who gave me their everything.\n NO no I dont regret. Getting bare minimum is big,I suppose.I envy people who cherish each other. Its really so hard to hold back tears and write all these cause its the best way.\n Though these are here somewhere in my writing, unread by anyone.\n Coming back ...... I envy people who get all attention from their beloved. If someone  really does, it will be reflected automatically.Knowing what they want without telling is biggest blessings.\n THere is always something more than me to do. I am always kept at least. What am I really getting punished for?\n For expecting someone to keep you at top.\n Where am I going if I cant even be prioritized? Where am I going if i cant feel cherish with someone with whom things are supposed to continued?\n Heavy heart when the heart was supposed to fly with wings when the person is around. Rather the heart gets heavy seeing those behavior and acts towards you. \n Happy moments barely come.\n Have to wait weeks to thirst my cravings. If I need anything I need to be attaintive to get it. If I am shopping , only I am shopping, He is only present there wondering  something, prolly. /nmade sure i wasnt hungry , who always asked how my day was , checkin between work was sweet , was available 24/7 on my words /call, someone who made sure what i liked and disliked , those small surprise gift, good at choosing stuffs , planned trips, a guy who read me through my eyes , fullfilled even my rubbish and stubborn wishes.\n not comparing . But i know what bear minimum is.   </p>"
  },
  {
    "id": 21,
    "title": " Some images that always remained fresh ",
    "date": "",
    "excerpt": "",
    "content": "<p> The last time I saw him was nearly a year ago.\n His image is still fresh in head. \n The first  apperance of his in 'Hattichaap Chappal'. The rudeness in his word. He didn't even offer a coffee or a drink or anything.\n RUTHLESS FELLOW; I am smriking  right now to this.\n Getting back .... He called me to see again. I was at Ranijhula next day all drenched in rain. On his one call I came at full speed to meet him at Java. JAVA at Krishna mandir holds a lot memories to me. Black and White Hair as if it was highlighed. A white, clear skin, I envy. Have you seen anyone smiling at you with open heart , I have sense him towards me. Those dazzling eyes .. they were pretty. What if I continue this in Nepali now\n ...<p>मलाई थाहा नै छैन मैले कसैलाई तेती नजिकै आफ्नो कसरि हुन दिए।  त्यो स्कूटर पछाडी  बसेर जादा हामी दुवैलाई आउने गीत गुन्गुनौथेउ।  जस्तै Somewhere only we know.  Norwegian wood  ke  रहेछ वन्नी कुरा दिमाग मा सधै औदथ्य्यो आफैलाई  नपढी थाहा नै भएन।  म कसरि नजिक  भए ? अब त आउदा जादा मेरो हात उहाको छातीमा हुने गर्थ्यो।  घर फर्किदा java पसेर coffee खानी त हाम्रो routine नै भयो।  मलाई नि उहा संगै हुदा को time  राम्रो लग्दथियो। उहाले आचानकसे एकदिन मेरो रूम जाम 'मेरो भाई हरु ले चिया बनाएर खुवौह्छन' भन्नुभयो।  नाई त मलाई भन्न आउदैन। चिया त मिठो नै थियो। सबै जना खाना खान जादा पनि मा चाही उहालाई नही कुर्थ्हे ।  त्यो je पाए तेही कुरा , त्यो random suggestion सायद मा कैले बिर्सिन्न। Back exam ko form vardiyeko aajha yaad xa.jun aajhai kateko xaina ni thaxaina  खै केहि कुरा हुन्छन नि बिर्सिन नसक्न। On his presence under the same horizon I had accompined him leavingmy own duties too. They were best thing I did. I went to every place out there where he has suggested me to go. I had read every single books he suggested.He is the inspiration for all the book I read. काम नबिगारी तैले का बाट सिक्छ्स भाई भान्नुहुन्थिय।  बिगार्न २/ ४ ओटा कुरा अनि बल्ल थाहुन्छ तलाई।  perfect  भन्नि कुरा हुन्न के  . These are the things he fed me hard. And though I implement it or not,they strike  hard at times.   .. to be continued . </p>"
  },

    {
    "id": 22,
    "title": "THEY ARE DOING FINE  ",
    "date": "29th sept 2025",
    "excerpt": "When we want something from heart, that really happens",
    "content": "<p>I saw him after 1 years and 9 months. Once I had imagined me to be wife of 35 years old man when i was 20 or may be just 19. He was a busy  business man but a guy with good money. Oh Shit don’t  assume it as sugar daddy please. No,  it was a true bond. We used walk miles and miles. He even  used even buy me veggies and fruits for the family. I am sounding like the writer of “ love story “ by Antov Checkov but yes that is true. Throughout the week days he used to be busy but he always made sure he called me to ask how I was or what am i doing. Things didnt used to give me good vibe, I wasnt happy either. But to compensate this he used to take me to expensive hotels and restaurant for dinners and some rides on weekend. I  love being captured. He used to put effort to make click my picture. At times he used to buy me expensive gifts. Not reallly gifts but he used to ask me what I needed.</p><p>I was serious. I mean I never took any men as a joke. I always used to think of marrying him. But attimes what used to hit  me was, 'The Age Gap'. How will my parents face the society ? How will  our kids be ? What will his side think ? will they think I was there for money? He wasnt the greenest guy. I used to feel he was seeing some other  girls too. But I never had any evidence. He was supportive in my career. He was willing to marry me. He wanted small wedding and with the rest of the money he was planning about holidays to Bali. I was never behind moneh I am never. I earn now.  Even when at that time When I didnt use to earn. His money never lure me. At times I was taken to most expensive dinners and brunches, he uplifted my lifestyle. He taught me about the proper dress sense. He used to fulfill my needs but not desires so dont go to far hai readers. I was always confused after a point, like DAMN where am I going? But he never pressurized me for things. He said he would wait until I will complete my bachelor and also he encouraged and supported for my future studies and abroad stuffs . He made me even clear he would come to see me every year if I ever thought of settling in foreign but also made clear he cant permanently shift to other land leaving his business here. I was okay with that. I didnt use to do much from my side. I used to receive a call once   a day and that was enough. He used to come over  in the afternoon and we used to go for coffee or somethimes in the morning for breakfast after he hit gym.He used to ask 'karcha xa ?' even though my answer used to be xa, he used to hadn me 500 or 1k always. May be his way of showing me. He used to buy me lots of food stuffs from bhatbhatini before I leave  town. But the age played role I guess or not. I never used to say what I feel and how much I needed him. His arms were home. I used to run into him with good or bad news. He was a good guy indeed and no doubt. I never regret we aparted but  I miss him at times.Seeing lavish perfumes makes me remind of him as he was fond of it. He hid one thing from me. He was a father of a child , his kid studied at grade 8 or 9 or 10.I vividly remember. Was I ready to marry someones husband , someones dad who is 10/12/15 years older to me ? What had I fallen for ? Should I have been with him him ? Or its ok  What did I FALL FOR ? Why did I leave someone in middle who ws willing to hold me for his entire life ? What am I searching for ? Did I get in this time gap ? Did I LOSE SOMETHING not being with him ? Was it hard ? How is he doing ? Did he gEt married ? or did he get back with his wife ? Does he miss me ???? or remember me ? Once he viewd my profile on tiktok too. He texted too but I felt its ok to let it be on seen and never reply that text again cause I dont have answer for  where and why I left without conclusion? Its hard, right ?   </p>"
  },
  {
    "id": 23,
    "title": "Some thoughts that aint leaving my head   ",
    "date": "23rd october, 2025",
    "excerpt": "the selfless feelings ",
    "content": "<p>I missed the shoulder I wanted to lean on , temporarily. The one who used to listen to my endless talks without getting bored, infact the endless talk that you can stay awake till 2 in the morning for that. The one who used to understand my silence. The one who used to wipe my tears when I was cry. The one who was there  for me in some moment of my life.\n  The one who used to  show the unconditional care for me, a silent care. The one who used to be my best friend and confident.\n I miss the selfless feelings that I had for them.\n I miss the love that I had for them.\n I miss the memories that we shared together.\n I miss the moments that we spent together.\n I miss everything about them.\n But most of all, I miss the person they were to me\n</p>. <p>The song that I am never tired of hearing,\nthe books I read cause I heard him  speak about them,\n the talks we had,\n the places we went for coffee, coffee was the common connection we had,\n he somewhere used to envy the capability of me being able to  intake massive caffine and still sleep for 8  hours.\n I am keeping all the snaps I had of him, though I never revisited them.\n</p><p>I am not being able to over come that particular person. 'Why?'\n May be nobody has been able to take that place in my life, yet. \nMay be I am waiting to see that person again.\n May be I am waiting to see that person who can make me forget them.\n But most of all, I am clueless too.</p>"
  }, 
  {
    "id": 24,
    "title": " ",
    "date": "8th nov, 2025 ",
    "excerpt": " khai?  ",
    "content": "<p>wait.. come back, come back from the thought of being with someone. Someone who did nothing to get you. YOU were there by your own as like you are being served without being asked. Flush the dreams you saw. Replace the place with some imaginary figure.Be with  someone who is eager to marry you, keep you with them, make family  and have babies. NOT  who is  afraid  WHO  fear their  parents.Its been long I havent heard 'girl , my girl .. you are looking pretty and I am lucky to have you.Turn passive and drop all plans. Start New.</p>"
  },
{
    "id": 25,
    "title": "Hellow FELLOWS ",
    "date": "19th nov, 2025 ",
    "excerpt": "   ",
    "content": "<p>Today I wont be talking about love and how I feel about it. I am here to share my progress. From Huawei I have been employed in next mobile company ..okay one of the competitor of Huawei, a good pay in fact for now, in such a  young age so yes good going girl. After this most importnat thing is that I will sharing few things that I improved in this long run from being 23 to 24 now.\n Work on yourself. When you work on yourself you dont care about others in a sense that there absence wont make you die or something\n okay okay I am being diverted again . coming back to  things that I have improved NOT to compare anything with anyone. It only hurts you. Hurts you the most. You feel like going in the past and living the life again where you wont be seeing the bad side of that past. So, GIRLS and BOYS  dont compare.\n  now moving to next part ... Take things lightly .. lightly as if even if the thing is not excuted that shouldnt hurt you, that shouldnt make you feel like you haev lost everything and you have no where to go now. I meant be ambitious but try to keep the back up too. And third part is .. dont be emotionally to much attached to someone. You need to have a partner with whom you need to share things but please not that much where you drain yourself, where you will run for everything to do them. okay if they turned out to be good its okay girl you get a good life .. but what  if not ? what if the guy only mmakes you feel like you are listening but not listening  infact. IN this case, your words will never be executed? So , plan solo. only let them know what are you planning. Dont drag them in the plan.. chill .. they are one part of your life, not the entire life.\n DID I spit out the truth ? let the words be words and keep pushing on yourself rather than other thing. you and only you matter at the end. your health , your peace, your everything. so dont let yourself to be too much to be  dependent on others .. nor financialyy ,nor emotionally , nor physically .. or in eithe rway. Thank you  </p>"
  },

  {"id": 26,
  "title": " A LETTER TO MY PAST SELF ",
  "date": " 3rd JAN , 2026 ",
  "excerpt": " Dear Past Me , I know you are going through a lot right now. ...",
  "content": "<p> Dear Past Me ,\n I know you are going through a lot right now. You feel lost, confused, and alone. But I want you to know that everything will be okay. You are stronger than you think, and you will get through this.\n Here are a few things I want you to remember\n . You are not alone. There are people who care about you and want to help you. Reach out to them.At times you might think you are independent, you  can do everythng on your own .. ummmh you can but still at times you need emotional support of others ..\n You deserve everything you have really wished of, dream of.  You can fulfill all the dreams of your parents  they have waved but have never let you know that they do. \n Just keep working as you are. You are amazing but sometimes its hard when people questions you and you dont really have anything to say to them. There questions left you puzzled. You might wonder on your own that what are you doing at the moment. Is it really the way you wanted to go things in your life. It's okay to not have all the answers.\n Its okay when you cant answer someone when they ask you something.Accept it but keep working.\n Believe in yourself. You can do anything you set your mind to.\n Thank you for all the people who have really seen me closely. Thank you to that one person who has helped you alot to complete your BE. We dont talk anymore. I dont know what are you doing in your life right now, May be you are married or you are still the same. Sorry I couldnt be with you till the end. No matter how much I will define in yours this will be less. I am so grateful for that 1 year or almost 1. 5 years. i miss that warm food and baklo daal, the rides and the talks, the care and the concern. Thank you for making me this capable. Yes, I am an ENGINEER and all sole hard works and tribute goes to you. PLease if you ever  found this on my bio I am really grateful. Pokhara lately was good vanda ni it wasnt as hard as it used to be with your presence. Thank you Sir. Thank you my parents. THANK you my Samyu and Sarul. Thank you my boyfriend. Now it's hard right now, but trust me, things will get better. You will find your way, and you will be happy again.\n With love,\n Future Me\n </p>"
},

  {"id": 27, 
   "title":" OPTIONS" , 
   "date":"11 TH JAN, 2026", 
   "excerpt":"        " , 
   "content":"<p> Things get ruined when you keep options. The true  desire get lost when you have options. You feel things less worthy when there are options, same case implies on people. Wait but NO.  The things is nothing. NO.. the thing is person can never change. Dont be too easy for anyone. Keep space . Make you hard to get, hard to be available. Dont be clingy  even you have that person for life. Stop complaining on people  and  STOP  expecting from people to treat you  the way you wanted to be treated. Stop saying more than three times. If someome really wants they wil. So stop pushing. I am opening options.  Options on job, option on  food, option on talking to people , option on us and WE.</p>" 
}, 

 {"id": 28, 
   "title":" WHaT a day " , 
   "date":"12 TH JAN, 2026", 
   "excerpt":" Even after a year or two I dont know , what can I expect  " , 
   "content":"<p>I was in your room.</p><p>You knew I was cold.</p><p>You knew I would not lie beside you</p><p>without first undressing,</p><p>without wearing what you wanted.</p><p>I waited.</p><p>Half an hour, maybe more.</p><p>Cold stayed with me.</p><p>Sad stayed longer.</p><p>You touched me</p><p>without asking what I felt.</p><p>You took what you wanted</p><p>while my feet stayed cold</p><p>for three long hours.</p><p>You did not move closer.</p><p>You did not try to warm me.</p><p>You did not give me water.</p><p>I was hungry all day.</p><p>After everything, you asked,</p><p>“Where to go now?”</p><p>I asked you to take me home.</p><p>You made me cry</p><p>in front of strangers.</p><p>You raised your voice.</p><p>You did not wipe my tears.</p><p>This is where I stop.</p><p>I will take off the ring</p><p>and leave it in a drawer.</p><p>I will delete our photos.</p><p>I will stop calling you “baby.”</p><p>What I felt is not love anymore.</p><p>My mind has changed.</p><p>My heart is tired.</p><p>I am done asking.</p><p>I am done waiting.</p><p>I want to run.</p><p>I want to leave.</p>"
 },

  {"id": 29, 
   "title":" A chapter I want to erase " , 
   "date":"1st Feb, 2026",
   "excerpt":" Some memories that neither  can be erased , nor can be forgotten  " , 
    "content":" <p>Someone once said me, we want to  remember them so we remember them, their action comes into our memories. I thought on this for a while.. OH ! not a while .. for a long while .. tried to  implemented it very slowly .. Now when I remember them ,forcing, my memories to remember them , I feel like how easily I forget about them. OKAY , that is one thing I forget it. The whole writing is going to be based into forgetting so here I will saying something that I really want to forget</p>. <p>I have no one right to spit this heart out, I supposed I had few, but , yes, that remains only supposition. I dont even remember that person who said me that you remember things cause you want to remember. But, anyways getting back... </p>.<p>Two people who made me feel like there is nothing impossible, if someone really wants. OKay , He was aged to me, I slightly  had fallen for him. He was an amazing person. He used asked me ' karcha xa ?', I was on my beginning my BE. I used to be over pampered with all his action. He was so great that he could read my eyes.Something or anything even without saying. He was so good to be left for this action. He used to romaticize everything for me. He used to praise my hair alot, he used to give random compliments, holding my hands were his favourite thing, my one call  and he would rush from  any corner of the Kathmandu to me, me in Pokhara or here , that didnt matter. I never heard he saying,  I have work, I cant come, what I used to hear is,' I can do that later mutu, you are my priority' Not only this, he used to love the way I walk, the way I talk; the most obsessed guy with me to date. Someone who never defends themselves when complained. Ailay demand  gareko kura ekxin ma aauthyo.My head feel like it's paining, even if I mistakenly said this.. I get call 10 times in an hour,'dear , are you okay ?''Shall I come to see you''Timi aau natra ' Amazing were those things. Fantastic era I lived .. even though I let them go on my own. I never thought I will say this or feel like saying this after complete 3 years, but I cant help . Or in other sense your action are being  unforgettable  because everywhere I go, I search that action from people , How dumb of me ? every single piece is unique as humans and I keep on expecting the same treatment once I  got . It really isnt a good sign , is it ? NO no .. but You taught me if they want they will. Cause I have seen people doing when they wanted. I never did cause I didnt want.He tried every possible way he could do to make me stay. UFF so fool of me .. I didnt realise what did i need.Being with the least made me realize what I lost. I really didnt nt like chura and jhumka , when I get you, you should wear it was his saying and I agreed. His choices were brilliant , better than mine , perfect in bargaining, a perfect shopping partner I always long for.We need to pour things in our life to one or other, I am pouring here not because I regret on the loss but to make my sel clam and forget what has been buried in my heart for so long cause I believed its sin to leave without explanation to anyone. Damn , he was perfect felow not a single mistake , not a single cheat nothing. He used to believe I am his everything , friend , partner , gossiper , with him he can discuss . I never used to do so. He said he would like to bury his head in my chest, which I barely let that happen when we were we. I did nt cry for him, he never made me baru i made a guy beg for me to stay . oh ! sin of me. Who ever might have been reading this might be think ing how cruel I am for all this but trust me not really, I never dated anyone, I didnt cheat bass I couldnt do as much as he did to me. I am sorry for that . I am in a phase right  now that I can speak for whole night about you for being a ideal in every gir's imagination .Just dont do less for the next cause we didnt end up together. damn how can someone love everything. He was the last guy till date whom I had talked about my body insercurities , my saggy and thic thighs , my love handles, my leg. Despite of all these insecurities he always made me feel i am beautiful.My 1 negative thought and his 50 positive sentences after that  People these day they dont even care what youthink even when you say it. Time with you were the time when I was clear about my future , confident, cherish, lovely. A man who never drunk, nor smoked nor any bad habits, perfecto hombre .</p><p>Why did I not like him when he was a clingly guy I always wanted. I ditched him like he didnt exist. I know, I knew , I was a world to him. He barely touched me in a wrong sense. I was everything for him. He knew what were the sizes of clothes that fitted me. He went to shopping for me when I was in Pokhara, damn a carton of clothes with all that were as per my fashion and sizes. From bra to shorts to kurtis to pants to tshirts to shoes to shocks. From jumkas to lipsticks to  kapal ma  launi dori to nailpaint to sunscreen every skin care I used. He carried all my expenses even without me uttering and wanting. Where ever he used to go souvenir was his must.He and I loved travelling. May be, I need to go to Banaras to erase you again. The warmth you gave in that cold rail way station keeping me as close to you,layering me with possible clothes as much as possible. Making me buy every single thing I touch. When I used to get worried about his wealth, he used to convience me that I was his Laxmi, spending on me was always his investment. He was the best consoler I had,  best consoler who clames my trembling heart everytime. When a single negative thing haunted me, he had 100 positive thing to say me to not let that thing come again.He was amy constant boooster. He never left me clueless, even when I was upset of anything, first thing he used to do was, to rush to me and say sorry , even if he hadnot done any mistakes. Hw was innocent.  He wanted to embrace everything of mine, my taste of music , my dress sense , he wanted to read the books I read ( if you ever landed on  this page , I hope you read 'SPUTNIK SWEETHEART' ), he used to even remember my parents birthay, my family events,  spoke like he have known them for ages, ready to get married to me any moment, ready to leave his built things herein Nepal and go with me where ever I would ask.  DAMN .. There was a moment in Pokhara .. where I  was so low , he came all the way from Ktm to see, a well decorated room, bags full of chocolates and my favourite food, littlr surprises, clothes to wear , room filled with balloon and a bouquet of flowers. I cried a lot at that time , he made me hear a Bhajan that time , I listened that so many times  and when ever even mistakenly if that is played now, I try to get away from that. Its been may be 3 years now the things had ended , but someone else's action is making me reminiscing things. Oh no not reminiscing , I dont remember them with great pleasure I just remember when things go wrong cause he never made me feel things can go wrong, if we want we can and he is the perfect example. I feel bad I only gave him a watch as his birthday gift and could never give much. I just wished I had given him things like he had given me his everything, There was a photo of mine in his  purese, I  wonder what he did to that picture , might have thrown or burnt or tore. If writing it  here erases  you from my past,  please go away. I could have pretended to have keep loving you, for  those kind of personal gain I was getting, But no nothing like cheating. But, yes , feeling were gone but I am glad I never cheated you. I just left. Left on Poush and left you clueless like where I could have gone. I left without any explanation, without any words to you, left like we didnt exist. The question might appear now, he was gentleman why did you left him.  I  left him making so miserable may be he ownt be able to trust anyone girls now , his precpetion might have changed, but from here I wanna apologize that , no, not everyone are like me, selfcentric. I lost feeling , I should have said and discuss and sorted this out, pardon me for running and leaving you clueless.But I dindt wanna give you false hope on love I stopped feeling for you. I dont want nowonwards your thought to envade me , I wanna stay away from you and  your thoughts in my head. It was like confession to never feel the shadow of your actions to come in my head again. A long way from where we aparted to here. Thank you </p>."
}

]






